/*
************************************************************************
【File Name】プラットフォーム機能関数
【Description】
【Revision History】
   REV.00 2014-02-02  BY R.ISHIKAWA
   REV.XX 20XX-XX-XX  BY X.XXXXXX
   REV.XX 20XX-XX-XX  BY X.XXXXXX
   REV.XX 20XX-XX-XX  BY X.XXXXXX

                      (C) 2013 IPL CORPORATION All Rights Reserved
************************************************************************
*/

/*
 * インクルード
 */
#include "HAL.h"
#include "Application.h"
#include "PF_Common.h"
#include "PFIn.h"

/*
 * 定数定義
 */

#define PF_IN_TIMER_MAX (100) // タイマカウント上限値(タイマ内部用)
#define PF_TIMER_MAX (1000)   // タイマカウント上限値

/*
 * 構造体宣言
 */
 

/*
 * 外部関数宣言
 */

/*
 * 内部関数宣言
 */

/******************************************************************************
【名称】1ミリ秒タイマ割り込み関数
******************************************************************************/
extern void PF_TimerIR(void);

/******************************************************************************
【名称】タスクメイン関数
******************************************************************************/
extern void PF_TaskMain(void);


/*
 * グローバル変数宣言
 */

/******************************************************************************
【名称】タイマ割り込みカウント数(割り込み内部用)
******************************************************************************/
UH PF_InTimerCnt;// 

/******************************************************************************
【名称】タイマ割り込みカウント数
******************************************************************************/
UH PF_TimerCnt;// 
/******************************************************************************
【名称】タイマ割り込みフラグ
******************************************************************************/
UB Pf_TimerFlg;//
/******************************************************************************
【名称】タスク状態管理構造体
******************************************************************************/
/*
STR_TaskData strData[] = {
{,},
{,}
}
*/



/******************************************************************************
【名称】プラットフォーム機能初期化関数
【再入】非リエントラント
【入力】なし
【出力】なし
【戻値】なし
【処理】HAL オペレーション（運用側面）で関数のエントリーを行う
******************************************************************************/
void PF_Init(void)
{
	// 変数初期化
	PF_InTimerCnt = 0;
	PF_TimerCnt = 0;
	Pf_TimerFlg = 0;
	// タイマ割り込み関数登録
	HAL_OPE_EntryTmrIR_1MS(PF_TimerIR);
	// メインタスク関数登録
	HAL_OPE_EntryTaskMain(PF_TaskMain);
}

/******************************************************************************
【名称】1ミリ秒タイマ割り込み関数
【再入】非リエントラント
【入力】なし
【出力】なし
【戻値】なし
【処理】タイマ割り込み時の処理を行う
******************************************************************************/
void PF_TimerIR(void)
{
	PF_TimerCnt++;
	Pf_TimerFlg = 1;
	if(PF_TimerCnt >= PF_TIMER_MAX)
	{
		PF_TimerCnt = 0;
	}

}

/******************************************************************************
【名称】タスクメイン関数
【再入】非リエントラント
【入力】なし
【出力】なし
【戻値】なし
【処理】タクス処理関数
******************************************************************************/
void PF_TaskMain(void)
{
	UB i = 1;
	// タスクメイン関数は無限ループとする
	while(i == 1)
	{

		if(PF_TimerCnt % 100 == 10)
		{
			APP_Switch_To_LED();
		}
		switch(PF_TimerCnt)
		{
			case 0:
				// モーター前進
				// APP_Motor_Set(HAL_MOTOR_FOWART, HAL_MOTOR_FOWART, 5000, 5000);
				// LED操作
				// APP_LED1_Set(HAL_LED_OFF);
				// LED操作
				// APP_LED2_Set(HAL_LED_OFF);
				break;
			case 500:
				// モーター後退
				// APP_Motor_Set(HAL_MOTOR_BACK, HAL_MOTOR_BACK, 5000, 5000);
				// LED操作
				// APP_LED1_Set(HAL_LED_ON);
				// LED操作
				// APP_LED2_Set(HAL_LED_ON);
				break;
			default:
				break;
		}
		Pf_TimerFlg = 0;
		// ウォッチドッグタイマを有効にする場合
		// ここにウォッチドッグタイマのリセット処理を入れる
	}
}
