/*
************************************************************************
【File Name】HAL 全割り込み禁止／復帰処理
【Description】
【Revision History】
   REV.00 2013-12-19  BY T.OOSAKI
   REV.XX 20XX-XX-XX  BY X.XXXXXX
   REV.XX 20XX-XX-XX  BY X.XXXXXX
   REV.XX 20XX-XX-XX  BY X.XXXXXX

                      (C) 2013 IPL CORPORATION All Rights Reserved
************************************************************************
*/

/*
 * インクルード
 */
#include "HALIn.h"

/*
 * 定数定義
 */

/*
 * 外部関数宣言
 */

/*
 * 内部関数宣言
 */

/*
 * グローバル変数宣言
 */

/******************************************************************************
【名称】全割り込み禁止
【再入】非リエントラント
【入力】なし
【出力】なし
【戻値】なし
【処理】全割り込み禁止
******************************************************************************/
UB	HAL_DisableIr( void )
{
	UB wk = IENR1.BIT.IENDT;
	IENR1.BIT.IENDT = 0;	// 割り込み禁止
	return wk;
}

/******************************************************************************
【名称】全割り込み復帰
【再入】非リエントラント
【入力】なし
【出力】なし
【戻値】なし
【処理】全割り込み復帰
******************************************************************************/
void HAL_ReturnIr( UB ubCCR )
{
	ubCCR &= 0x01;
	IENR1.BIT.IENDT = ubCCR;	// 割り込み復帰
}
